app/controllers/restaurant/dishes_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 1 LIMIT 1
---
  def index
    # get_id returns user id, by which we will get restaurant_id and take dishes form there
    @restaurant = Restaurant.find(get_id)

SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = 7 LIMIT 1
---
  def show
    @dish = Dish.find(params[:id])