app/views/restaurant/dishes/index.html.erb

<section id="dish-cards">
    <% @restaurant.dishes.each do |dish| %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."restaurant_id" = 1