app/controllers/application_controller.rb

UPDATE "miscs" SET "otp" = 190500, "updated_at" = '2025-01-27 03:37:13.640514' WHERE "miscs"."id" = 5
---
  def send_otp(user)
     # genrating otp to send via mail
    otp = rand(100000 .. 999999)
    # we send mail immediatly after object creation
    UserMailer.with(user: user,otp: otp).account_creation_verification_mail.deliver_now
    # update otp in user misc
    user.misc.update! otp: otp

SELECT "users".* FROM "users" WHERE "users"."email" = 'divjain@fboia.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'ssdfh@sdg.csdv' LIMIT 1
---
  def user_verification(user)
    # converting email to downcase in order to avoid bugs
    user.email = user.email.downcase

    # check for user existance
    if User.find_by(email: user.email)
      if user.verified_tag
        redirect_to new_auth_path
      else
        # update the existing record in db
        User.find_by(email: user.email).update user.as_json