app/controllers/authentication_controller.rb

  def create
    # check for user existance with given email but in lowercase, as records are in same way
    user = User.find_by(email: params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'divjain@bestpeers.in' LIMIT 1