app/controllers/user_controller.rb

  def verification
    user = User.find(cookies[:temp_id])
    if user.misc.otp == params[:otp].to_i
      user.update_column(:verified_tag, true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1
UPDATE "users" SET "verified_tag" = TRUE WHERE "users"."id" = 7