app/controllers/users/clients_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
---
  def create
    # creating an object of user, as client has no additional fileds we will use only Client.new
    @user = User.new user_params(:client), entryable: Client.new

    # genrating otp to send via mail
    @otp = rand(100000 .. 999999)
    # we send mail immediatly after object creation
    UserMailer.with(user: @user,otp: @otp).account_creation_verification_mail.deliver_now