app/controllers/users/riders_controller.rb

  def create
    # creating an object of user, with rider_params
    user = User.new user_params(:rider).merge(entryable: (Rider.create rider_params), misc: Misc.new)
---
INSERT INTO "miscs" ("user_id", "otp", "created_at", "updated_at") VALUES (1, NULL, '2025-01-24 07:00:12.263723', '2025-01-24 07:00:12.263723') RETURNING "id"
INSERT INTO "riders" ("status", "driving_licence", "vehical_number", "date_of_birth", "created_at", "updated_at") VALUES (NULL, 'ssdfh@sdg.csdv', 'ssdfh@sdg.csdv', '2007-01-01', '2025-01-24 06:56:58.122037', '2025-01-24 06:56:58.122037') RETURNING "id"
INSERT INTO "users" ("entryable_type", "entryable_id", "name", "email", "password_digest", "phone", "address", "created_at", "updated_at", "verified_tag") VALUES ('Rider', 1, 'text', 'test@rider.com', '$2a$12$P0BtmC125RTZGAGKH3CeZ.e/IKT0WJpPktNIunPJvuIu4TrHpbq4i', '1253893858923', 'test@rider.comtest@rider.comtest@rider.comtest@rider.com', '2025-01-24 07:00:12.261467', '2025-01-24 07:00:12.261467', FALSE) RETURNING "id"